# Jour 2: 

## Introduction au différents libraries de python
* Introduction à l'apprentissage automatique
* Différence entre l'apprentissage supervisé et non supervisé
    * classification
    * Régression
* Introduction à la librairie numpy
* Introduction au bibliothèque Pandas ( création de data frame, series, lire des fichier, indexation, visualisation, etc)



*Par [Abdoulaye Balde](https://www.linkedin.com/in/abdoulayegk)*

# **Initiation au concept de Dataframe**

La dataframe est la principale structure de données de la librairie [Pandas](https://pypi.org/project/pandas/). Dans une dataframe, les données se présentent sous formes de tableau (lignes et colonnes). Plus précisement, dans une dataframe on parle d'observations (pour désigner les lignes) et de variables (pour désigner les colonnes).     
[Wes Mckinney](https://wesmckinney.com/), créateur de la librairie Pandas.

On peut créer une dataframe pandas à partir d'un dictionnaire :

1.   Importer la librairie pandas (*import pandas as pd*)
2.   Création du dictionnaire s'il n'existe pas encore
3.   Transformation du dictionnaire en dataframe :          
*df = pd.DataFrame(dictionnaire)*

***Exercice :***

Créer un dictionnaire pour stocker les notes par 4 élèves en Maths et Français. Transformez ce dictionnaire en Dataframe.        
Transposez la dataframe créée (lignes en colonnes puis colonnes en lignes) et renommez les colonnes.          
Ryan (18 , 16) ; Elisa (20 , 12), Martine (20, 20), Robert (14, 15). La première note est celle obtenue en Maths et la deuxième est pour le Français.

In [1]:
# Création du dictionnaire notes

notes = {'Oumar':[18, 16], 
         'Alpha':[20, 12], 
         'Ahmad':[20, 20], 
         'Ousmane':[14, 15]}
notes

{'Oumar': [18, 16], 'Alpha': [20, 12], 'Ahmad': [20, 20], 'Ousmane': [14, 15]}

In [2]:
traduction = {"chien": "Dog", "Chat": "Cat", "Guinee": "Guinea"}
traduction

{'chien': 'Dog', 'Chat': 'Cat', 'Guinee': 'Guinea'}

# Series in Pandas

In [3]:
# we first import series from pandas
from pandas import Series

In [4]:
# let's first creat a serie
mylist = [20, 20, 30, 40]

s = Series(mylist)
s

0    20
1    20
2    30
3    40
dtype: int64

In [5]:
# you can also et your own index because the default index start from 0 till n
ss = Series(
    [12, 13, 7, 80, 95], index=list("abcde")
)  # not we can use index=['a','b',..]
ss


# # you can also change the datatype to float or unsigned int
# Series(
#     [20.5, 12, 34, 56, 100],
#     index=["a", "b", "c", "d", "e"],
# )

a    12
b    13
c     7
d    80
e    95
dtype: int64

In [6]:
# On peux changer les type de donne par defaut c'est None
s1 = Series([12, 13, 7, 80, 95], index=list("abcde"), dtype="int8")
s1

a    12
b    13
c     7
d    80
e    95
dtype: int8

In [7]:
# we can use index of integer of our choice for that we use the range function
ex1 = Series([5, 3, 7, 8, 19], index=range(10, 15))
ex1

10     5
11     3
12     7
13     8
14    19
dtype: int64

# Sclicing series

In [8]:
# using the above example we want to get the value at index 10 we can do following
ex1[10]  # output should be 5

5

In [9]:
# you can also add element to your series. Let's say I want to add 200 in ss
ss["f"] = 200
ss

a     12
b     13
c      7
d     80
e     95
f    200
dtype: int64

In [10]:
# use can use comparaison operatiors on series
ss > 12


# # To make look nice and more readable this will return a series of integer
# ss[ss < 13]

a    False
b     True
c    False
d     True
e     True
f     True
dtype: bool

In [11]:
# What will be difference between the following two lines(list and array)

# l = [12, 13, 7, 80, 95] * 2
# print(l)
# print("\n\n")

# print(ss * 2)

# Indexing in pandas¶

L'opérateur d'indexation et la sélection d'attributs sont agréables car ils fonctionnent comme ils le font dans le reste de l'écosystème Python. En tant que novice, cela les rend faciles à prendre en main et à utiliser. Cependant, pandas a ses propres opérateurs d'accès, **loc et iloc**. Pour les opérations plus avancées, ce sont celles que vous êtes censé utiliser.

# Sélection basée sur l'index(loc and iloc)
L'indexation Pandas fonctionne dans l'un des deux paradigmes. 
* La première est la sélection basée sur l'index : sélectionner des données en fonction de leur position numérique dans les données. iloc suit ce paradigme.

Pour sélectionner la première ligne de données dans un DataFrame, nous pouvons utiliser ce qui suit :

In [12]:
ss

a     12
b     13
c      7
d     80
e     95
f    200
dtype: int64

In [13]:
ss.iloc[0]

12

In [14]:
ss.loc['c']

7

In [20]:
# Transformation du dictionnaire notes en dataframe
import pandas as pd
df = pd.DataFrame(notes)
df

   Oumar  Alpha  Ahmad  Ousmane
0     18     20     20       14
1     16     12     20       15

In [21]:
# Transposition de la dataframe df
df = df.T
df

          0   1
Oumar    18  16
Alpha    20  12
Ahmad    20  20
Ousmane  14  15

In [22]:
# Renommer les colonnes
df.columns = ['Maths', 'Français']
df

         Maths  Français
Oumar       18        16
Alpha       20        12
Ahmad       20        20
Ousmane     14        15

In [23]:
# Indexes de df
df.index

Index(['Oumar', 'Alpha', 'Ahmad', 'Ousmane'], dtype='object')

Cette petite section sur les dataframes Pandas est une introduction à Pandas. Pandas et Numpy sont des librairies fondamentales en Data Science. Il y aura donc deux grandes sections consacrées exclusivement à ces deux librairies.

In [25]:
from pandas import DataFrame
data = {
    "capital": [
        "Delhi",
        "Dakar",
        "Bamako",
        "Paris",
        "Accra",
        "Conakry",
        "Ottawa",
        "Lome",
        "Yamoussokro",
        "Freetown",
        "Raba",
        "Berlin",
        "Genever",
        "washington",
        "washington",
    ],
    "year": [
        2001,
        2004,
        2007,
        2010,
        2015,
        2001,
        2005,
        2008,
        2011,
        2019,
        2001,
        2003,
        2007,
        2009,
        2017,
    ],
    "pop": [
        2.45,
        2.99,
        3.01,
        3.50,
        4.24,
        2.47,
        2.73,
        2.85,
        2.99,
        3.11,
        2.11,
        3.00,
        3.67,
        3.73,
        3.97,
    ],
}

df = DataFrame(data)
df

        capital  year   pop
0         Delhi  2001  2.45
1         Dakar  2004  2.99
2        Bamako  2007  3.01
3         Paris  2010  3.50
4         Accra  2015  4.24
5       Conakry  2001  2.47
6        Ottawa  2005  2.73
7          Lome  2008  2.85
8   Yamoussokro  2011  2.99
9      Freetown  2019  3.11
10         Raba  2001  2.11
11       Berlin  2003  3.00
12      Genever  2007  3.67
13   washington  2009  3.73
14   washington  2017  3.97

In [27]:
# work more on this dataframe

In [28]:
# Exo get a new dataframe that contain only year greater or equal to 2005